#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.azurerm_dns_zone.badbort: Reading...
data.azurerm_dns_zone.badbort: Read complete after 0s [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-common/providers/Microsoft.Network/dnszones/badbort.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_container_group.cg will be created
  + resource "azurerm_container_group" "cg" {
      + dns_name_label      = "backstage"
      + exposed_port        = (known after apply)
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + ip_address          = (known after apply)
      + ip_address_type     = "Public"
      + location            = "australiaeast"
      + name                = "aci-backstage"
      + os_type             = "Linux"
      + resource_group_name = "rg-backstage"
      + restart_policy      = "Always"

      + container {
          + commands                     = (known after apply)
          + cpu                          = 0.5
          + image                        = "registry.hub.docker.com/bortos/fredstage:latest"
          + memory                       = 0.5
          + name                         = "backstage"
          + secure_environment_variables = (sensitive value)

          + ports {
              + port     = 7007
              + protocol = "TCP"
            }
        }
      + container {
          + commands = [
              + "caddy",
              + "reverse-proxy",
              + "--from",
              + "backstage.australiaeast.azurecontainer.io",
              + "--to",
              + "localhost:7007",
            ]
          + cpu      = 0.5
          + image    = "caddy"
          + memory   = 0.5
          + name     = "caddy"

          + ports {
              + port     = 443
              + protocol = "TCP"
            }
          + ports {
              + port     = 80
              + protocol = "TCP"
            }

          + volume {
              + empty_dir            = false
              + mount_path           = "/data"
              + name                 = "aci-caddy-data"
              + read_only            = false
              + share_name           = "backstage-caddy-data"
              + storage_account_key  = (sensitive value)
              + storage_account_name = "backstagetestingsta"
            }
        }
    }

  # azurerm_dns_cname_record.example will be created
  + resource "azurerm_dns_cname_record" "example" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "backstage"
      + record              = (known after apply)
      + resource_group_name = "rg-common"
      + ttl                 = 300
      + zone_name           = "badbort.com"
    }

  # azurerm_resource_group.rg_backstage will be created
  + resource "azurerm_resource_group" "rg_backstage" {
      + id       = (known after apply)
      + location = "australiaeast"
      + name     = "rg-backstage"
      + tags     = {
          + "environment" = "dev"
          + "project"     = "project-alpha"
        }
    }

  # azurerm_storage_account.sta will be created
  + resource "azurerm_storage_account" "sta" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "LRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = true
      + cross_tenant_replication_enabled  = true
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "australiaeast"
      + min_tls_version                   = "TLS1_2"
      + name                              = "backstagetestingsta"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "rg-backstage"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"

      + blob_properties {
          + change_feed_enabled           = (known after apply)
          + change_feed_retention_in_days = (known after apply)
          + default_service_version       = (known after apply)
          + last_access_time_enabled      = (known after apply)
          + versioning_enabled            = (known after apply)

          + container_delete_retention_policy {
              + days = (known after apply)
            }

          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)

          + private_link_access {
              + endpoint_resource_id = (known after apply)
              + endpoint_tenant_id   = (known after apply)
            }
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      + share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + retention_policy {
              + days = (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + versions                        = (known after apply)
            }
        }
    }

  # azurerm_storage_share.caddy_sc will be created
  + resource "azurerm_storage_share" "caddy_sc" {
      + access_tier          = (known after apply)
      + enabled_protocol     = "SMB"
      + id                   = (known after apply)
      + metadata             = (known after apply)
      + name                 = "backstage-caddy-data"
      + quota                = 1
      + resource_manager_id  = (known after apply)
      + storage_account_name = "backstagetestingsta"
      + url                  = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @badbort, Action: `pull_request`, Working Directory: ``, Workflow: `.github/workflows/deploy.yml`*